Public Attributes | List of all members
API_BeamSegmentType Struct Reference
Element Manager API
Represents an segment of the beam element. More...
#include <APIdefs_Elements.h>
 Public Attributes
API_Elem_Head  | head
General element header.
API_Guid  | owner
The guid of the owner beam.
API_AssemblySegmentData  | assemblySegmentData
General informations about segment.
API_OverriddenAttribute  | leftMaterial
The material override structure of the left side of the beam.
API_OverriddenAttribute  | topMaterial
Material override structure of the top of the beam.
API_OverriddenAttribute  | rightMaterial
Material override structure of the right side of the beam.
API_OverriddenAttribute  | bottomMaterial
Material override structure of the bottom of the beam.
API_OverriddenAttribute  | endsMaterial
The material override structure of the beginning and end side of the beam.
bool  | materialsChained
Are surface materials chained?
Detailed Description
Represents an segment of the beam element.
Member Data Documentation
◆ assemblySegmentData
 API_BeamSegmentType::assemblySegmentData
General informations about segment.
◆ bottomMaterial
 API_BeamSegmentType::bottomMaterial
Material override structure of the bottom of the beam.
◆ endsMaterial
 API_BeamSegmentType::endsMaterial
The material override structure of the beginning and end side of the beam.
◆ head
 API_BeamSegmentType::head
General element header.
◆ leftMaterial
 API_BeamSegmentType::leftMaterial
The material override structure of the left side of the beam.
◆ materialsChained
 API_BeamSegmentType::materialsChained
Are surface materials chained?
◆ owner
 API_BeamSegmentType::owner
The guid of the owner beam.
◆ rightMaterial
 API_BeamSegmentType::rightMaterial
Material override structure of the right side of the beam.
◆ topMaterial
 API_BeamSegmentType::topMaterial
Material override structure of the top of the beam.